app/views/books/_form.html.erb

    <%= form.label :author_id %>
    <%= form.collection_select :author_id, Author.all, :id, :name, { prompt: "Select author" }, class: "block shadow rounded-md border border-gray-200 outline-none px-3 py-2 mt-2 w-full" %>
---
SELECT "authors".* FROM "authors"