app/controllers/authors_controller.rb

INSERT INTO "authors" ("name", "nationality", "cpf", "date_of_birth", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Sthephen King"], ["nationality", "EUA"], ["cpf", "292725262"], ["date_of_birth", "1969-06-19"], ["created_at", "2024-04-29 05:30:39.487551"], ["updated_at", "2024-04-29 05:30:39.487551"]]
---
  def create
    @author = Author.new(author_params)

    respond_to do |format|
      if @author.save

UPDATE "authors" SET "name" = $1, "updated_at" = $2 WHERE "authors"."id" = $3  [["name", "Elena Petro"], ["updated_at", "2024-04-30 23:12:59.409860"], ["id", 58]]
---
  def update
    respond_to do |format|
      if @author.update(author_params)

DELETE FROM "authors" WHERE "authors"."id" = $1  [["id", 2]]
---
  def destroy
    @author.destroy!