app/controllers/books_controller.rb

INSERT INTO "books" ("title", "author_id", "genre", "publication_date", "created_at", "updated_at", "isbn", "photo") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save

UPDATE "books" SET "updated_at" = $1, "photo" = $2 WHERE "books"."id" = $3  [["updated_at", "2024-05-06 20:29:56.125398"], ["photo", "#<ActionDispatch::Http::UploadedFile:0x00007e21bd623a60>"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @book.update(book_params)

DELETE FROM "books" WHERE "books"."id" = $1  [["id", 2]]
---
  def destroy
    @book.destroy!