app/controllers/suppliers_controller.rb

SELECT "suppliers".* FROM "suppliers"
---
  def index
    @suppliers = Supplier.all

INSERT INTO "accounts" ("account", "account_digit", "account_type", "bank", "supplier_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
INSERT INTO "suppliers" ("name", "address", "contact", "created_at", "updated_at", "cnpj") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Lucas"], ["address", "Cantagalo"], ["contact", "11943195830"], ["created_at", "2024-05-09 17:07:43.763971"], ["updated_at", "2024-05-09 17:07:43.763971"], ["cnpj", nil]]
---
  def create
    @supplier = Supplier.new(supplier_params)
    @account = @supplier.build_account(account_params)

    respond_to do |format|
      if @supplier.save && @account.save

UPDATE "accounts" SET "account_digit" = $1, "account_type" = $2, "bank" = $3, "updated_at" = $4 WHERE "accounts"."id" = $5  [["account_digit", ""], ["account_type", ""], ["bank", ""], ["updated_at", "2024-05-09 20:44:41.061607"], ["id", 7]]
---
  def update
    respond_to do |format|
      if @supplier.update(supplier_params) && @supplier.account.update(account_params)

DELETE FROM "suppliers" WHERE "suppliers"."id" = $1  [["id", 1]]
---
  def destroy
    @supplier.destroy!

SELECT "suppliers".* FROM "suppliers" WHERE "suppliers"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def set_supplier
    @supplier = Supplier.find(params[:id])