app/views/suppliers/_form.html.erb

  <%= form_with(model: @supplier, class: "contents") do |form| %>
    <% if @supplier.errors.any? || (@supplier.account && @supplier.account.errors.any?) %>
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."supplier_id" = $1 LIMIT $2  [["supplier_id", 2], ["LIMIT", 1]]

              <% formatted_message = formatted_message.gsub("Account account type can't be blank", "Tipo de conta é obrigatório") %>
            <% elsif formatted_message.include?("Account bank can't be blank") %>
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."supplier_id" = $1 LIMIT $2  [["supplier_id", 9], ["LIMIT", 1]]