app/views/suppliers/_supplier.html.erb


  <% if supplier.account.present? %>
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."supplier_id" = $1 LIMIT $2  [["supplier_id", 10], ["LIMIT", 1]]