app/views/suppliers/show.html.erb

SELECT "accounts".* FROM "accounts" WHERE "accounts"."supplier_id" = $1 LIMIT $2  [["supplier_id", 16], ["LIMIT", 1]]
---

    <% if @supplier.account.present? %>
      <div class="grid grid-cols-2 gap-4 w-full">
        <% [:account, :account_digit, :account_type, :bank].each do |attribute| %>